comparedDBs/performance_test_scripts/leveldb_scripts/leveldb_zipf/divider_1/value_size_256/leveldb_1.0B_val_256_zipf_{1.5}.log
../../../../KV_stores/leveldb/build/db_bench --db=/mnt/nvme/level8B --num=1000000000 --value_size=256 --batch_size=1000 --benchmarks=fillzipf,stats --range=1000000000 --logpath=/mnt/ssd --bloom_bits=10 --log=1 --cache_size=8388608 --open_files=40000 --stats_interval=100000000 --histogram=1 --write_buffer_size=67108864 --data_file=/home/wangzizhao/workloads/zipf_keys1.0B_zipf1.5.csv --max_file_size=67108864 --print_wa=true 
Keys:       16 bytes each
Values:     256 bytes each (128 bytes after compression)
Entries:    1000000000
RawSize:    259399.4 MB (estimated)
FileSize:   137329.1 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
WARNING: Snappy compression is not enabled
------------------------------------------------
2024-02-03 09:36:23 ... thread 0: (100000000,100000000) ops and (143453.1,143453.1) ops/second in (697.091728,697.091728) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  1        1       55       251        0     25965
  2        2       80       264    48442     22612
user_io:26020.444 total_ios: 48577.009 WriteAmplification: 1.8669

2024-02-03 09:47:54 ... thread 0: (100000000,200000000) ops and (144689.9,144068.9) ops/second in (691.133121,1388.224849) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        3      166       227        0     23640
  1        1        8       341    24062     29129
  2        2       88       317    55989     27610
  3        1       65         0        0         0
user_io:52040.883 total_ios: 80378.918 WriteAmplification: 1.5445

2024-02-03 09:59:26 ... thread 0: (100000000,300000000) ops and (144438.2,144191.8) ops/second in (692.337754,2080.562603) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       55       479        0     49660
  1        1        5       415    50855     30008
  2        1       49       333    57723     29214
  3        2      126         2      293       224
user_io:78061.326 total_ios: 109106.495 WriteAmplification: 1.3977

2024-02-03 10:11:02 ... thread 0: (100000000,400000000) ops and (143705.6,144069.9) ops/second in (695.867110,2776.429713) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        4      221       729        0     75736
  1        1       10       489    77426     30883
  2        2       73       347    59255     30626
  3        3      153         4      484       377
user_io:104137.134 total_ios: 137622.578 WriteAmplification: 1.3216

2024-02-03 10:22:35 ... thread 0: (100000000,500000000) ops and (144386.9,144133.2) ops/second in (692.583541,3469.013254) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      111       979        0    101757
  1        1        7       563   104216     31759
  2        2       93       363    60968     32203
  3        3      178         6      702       555
user_io:130157.576 total_ios: 166274.176 WriteAmplification: 1.2775

2024-02-03 10:34:13 ... thread 0: (100000000,600000000) ops and (143127.1,143964.5) ops/second in (698.679508,4167.692762) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       55      1230        0    127832
  1        1        3       636   131012     32640
  2        1       59       378    62636     33747
  3        4      223        10     1211       979
user_io:156233.378 total_ios: 195199.309 WriteAmplification: 1.2494

2024-02-03 10:45:49 ... thread 0: (100000000,700000000) ops and (143820.2,143943.9) ops/second in (695.312861,4863.005623) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        3      166      1478        0    153853
  1        1        8       709   157578     33511
  2        2       78       393    64229     35216
  3        4      244        12     1499      1223
user_io:182253.822 total_ios: 223802.460 WriteAmplification: 1.2280

2024-02-03 10:57:21 ... thread 0: (100000000,800000000) ops and (144464.9,144008.8) ops/second in (692.209793,5555.215416) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       55      1730        0    179873
  1        1        5       784   184371     34390
  2        2       98       409    65992     36843
  3        5      265        15     1808      1488
user_io:208274.264 total_ios: 252594.113 WriteAmplification: 1.2128

2024-02-03 11:08:53 ... thread 0: (100000000,900000000) ops and (144459.5,144058.7) ops/second in (692.235759,6247.451175) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        4      221      1976        0    205949
  1        1       10       857   210941     35264
  2        1       61       424    67545     38280
  3        5      303        21     2488      2076
user_io:234350.069 total_ios: 281568.546 WriteAmplification: 1.2015

2024-02-03 11:20:28 ... thread 0: (100000000,1000000000) ops and (143914.6,144044.3) ops/second in (694.856753,6942.307928) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       55      2228        0    231969
  1        1        8       932   237786     36140
  2        2       84       439    69214     39818
  3        5      322        24     2856      2399
user_io:260370.515 total_ios: 310326.231 WriteAmplification: 1.1919

1000000000 operations have been finished (259399.414 MB data have been written into db)
fillzipf     :       6.942 micros/op 144044 ops/sec;   37.4 MB/s
Microseconds per op:
Count: 1000000000  Average: 6.9423  StdDev: 11.40
Min: 4.0000  Median: 7.2034  Max: 47528.0000
------------------------------------------------------
[       4,       5 )  253394   0.025%   0.025% 
[       5,       6 ) 178661172  17.866%  17.891% ####
[       6,       7 ) 266237585  26.624%  44.515% #####
[       7,       8 ) 269609933  26.961%  71.476% #####
[       8,       9 ) 164225835  16.423%  87.899% ###
[       9,      10 ) 62447092   6.245%  94.144% #
[      10,      12 ) 45486818   4.549%  98.692% #
[      12,      14 ) 8692176   0.869%  99.561% 
[      14,      16 ) 1287027   0.129%  99.690% 
[      16,      18 )  756299   0.076%  99.766% 
[      18,      20 )  712773   0.071%  99.837% 
[      20,      25 ) 1051827   0.105%  99.942% 
[      25,      30 )  442951   0.044%  99.986% 
[      30,      35 )   46991   0.005%  99.991% 
[      35,      40 )   18855   0.002%  99.993% 
[      40,      45 )    9713   0.001%  99.994% 
[      45,      50 )    6599   0.001%  99.995% 
[      50,      60 )    6896   0.001%  99.995% 
[      60,      70 )    8121   0.001%  99.996% 
[      70,      80 )   10243   0.001%  99.997% 
[      80,      90 )   12596   0.001%  99.998% 
[      90,     100 )    2642   0.000%  99.999% 
[     100,     120 )    3016   0.000%  99.999% 
[     120,     140 )    1885   0.000%  99.999% 
[     140,     160 )     468   0.000%  99.999% 
[     160,     180 )     263   0.000%  99.999% 
[     180,     200 )     112   0.000%  99.999% 
[     200,     250 )      55   0.000%  99.999% 
[     250,     300 )       9   0.000%  99.999% 
[     300,     350 )       5   0.000%  99.999% 
[     350,     400 )       1   0.000%  99.999% 
[     450,     500 )       1   0.000%  99.999% 
[     500,     600 )      67   0.000%  99.999% 
[     600,     700 )      38   0.000%  99.999% 
[     800,     900 )       1   0.000%  99.999% 
[     900,    1000 )       1   0.000%  99.999% 
[    1600,    1800 )       4   0.000%  99.999% 
[    1800,    2000 )      19   0.000%  99.999% 
[    2000,    2500 )     740   0.000%  99.999% 
[    2500,    3000 )    1924   0.000% 100.000% 
[    3000,    3500 )    2205   0.000% 100.000% 
[    3500,    4000 )     157   0.000% 100.000% 
[    4000,    4500 )     167   0.000% 100.000% 
[    4500,    5000 )     153   0.000% 100.000% 
[    5000,    6000 )      90   0.000% 100.000% 
[    6000,    7000 )      62   0.000% 100.000% 
[    7000,    8000 )     777   0.000% 100.000% 
[    8000,    9000 )     176   0.000% 100.000% 
[    9000,   10000 )      40   0.000% 100.000% 
[   10000,   12000 )       7   0.000% 100.000% 
[   12000,   14000 )       2   0.000% 100.000% 
[   14000,   16000 )       3   0.000% 100.000% 
[   16000,   18000 )       1   0.000% 100.000% 
[   18000,   20000 )       3   0.000% 100.000% 
[   20000,   25000 )       5   0.000% 100.000% 
[   25000,   30000 )       2   0.000% 100.000% 
[   30000,   35000 )       1   0.000% 100.000% 
[   35000,   40000 )       1   0.000% 100.000% 
[   45000,   50000 )       1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       55      2228        0    231969
  1        1        8       932   237786     36140
  2        2       84       439    69214     39818
  3        5      322        24     2856      2399
user_io:260370.515 total_ios: 310326.231 WriteAmplification: 1.1919